bloombloombloom/Bloom/src/Targets/Microchip/AVR/PartDescriptionFiles/AVR8/MEGA/ATMEGA8515.xml
<?xml version="1.0" encoding="UTF-8"?>
<part-description-file>
    <variants>
        <variant tempmin="0" tempmax="0" speedmax="0" package="" ordercode="standard" vccmin="2.7" vccmax="5.5"/>
    </variants>
    <devices>
        <device name="ATmega8515" architecture="AVR8" family="megaAVR">
            <address-spaces>
                <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x2000">
                    <memory-segment start="0x0000" size="0x2000" type="flash" rw="RW" exec="1" name="FLASH"
                                    pagesize="0x40"/>
                    <memory-segment start="0x1f00" size="0x0100" type="flash" rw="RW" exec="1" name="BOOT_SECTION_1"
                                    pagesize="0x40"/>
                    <memory-segment start="0x1e00" size="0x0200" type="flash" rw="RW" exec="1" name="BOOT_SECTION_2"
                                    pagesize="0x40"/>
                    <memory-segment start="0x1c00" size="0x0400" type="flash" rw="RW" exec="1" name="BOOT_SECTION_3"
                                    pagesize="0x40"/>
                    <memory-segment start="0x1800" size="0x0800" type="flash" rw="RW" exec="1" name="BOOT_SECTION_4"
                                    pagesize="0x40"/>
                </address-space>
                <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
                    <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
                </address-space>
                <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0002">
                    <memory-segment start="0" size="0x0002" type="fuses" rw="RW" exec="0" name="FUSES"/>
                </address-space>
                <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
                    <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
                </address-space>
                <address-space endianness="little" name="data" id="data" start="0x0000" size="0x10000">
                    <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
                    <memory-segment name="MAPPED_IO" start="0x0020" size="0x0040" type="io" external="false"/>
                    <memory-segment name="IRAM" start="0x0060" size="0x0200" type="ram" external="false"/>
                    <memory-segment name="XRAM" start="0x0260" size="0xfda0" type="ram" external="true"/>
                </address-space>
                <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0200">
                    <memory-segment start="0x0000" size="0x0200" type="eeprom" rw="RW" exec="0" name="EEPROM"
                                    pagesize="0x04"/>
                </address-space>
                <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
                <address-space endianness="little" name="osccal" id="osccal" start="0" size="4">
                    <memory-segment start="0" size="4" type="osccal" rw="R" exec="0" name="OSCCAL"/>
                </address-space>
            </address-spaces>
            <peripherals>
                <module name="AC">
                    <instance name="AC" caption="Analog Comparator">
                        <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data"
                                        caption="Analog Comparator"/>
                    </instance>
                </module>
                <module name="USART">
                    <instance name="USART" caption="USART">
                        <register-group name="USART" name-in-module="USART" offset="0x00" address-space="data"
                                        caption="USART"/>
                    </instance>
                </module>
                <module name="SPI">
                    <instance name="SPI" caption="Serial Peripheral Interface">
                        <register-group name="SPI" name-in-module="SPI" offset="0x00" address-space="data"
                                        caption="Serial Peripheral Interface"/>
                    </instance>
                </module>
                <module name="CPU">
                    <instance name="CPU" caption="CPU Registers">
                        <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data"
                                        caption="CPU Registers"/>
                        <parameters>
                            <param name="CORE_VERSION" value="V2E"/>
                        </parameters>
                    </instance>
                </module>
                <module name="EXINT">
                    <instance name="EXINT" caption="External Interrupts">
                        <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data"
                                        caption="External Interrupts"/>
                    </instance>
                </module>
                <module name="WDT">
                    <instance name="WDT" caption="Watchdog Timer">
                        <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data"
                                        caption="Watchdog Timer"/>
                    </instance>
                </module>
                <module name="TC8">
                    <instance name="TC0" caption="Timer/Counter, 8-bit">
                        <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 8-bit"/>
                    </instance>
                </module>
                <module name="TC16">
                    <instance name="TC1" caption="Timer/Counter, 16-bit">
                        <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data"
                                        caption="Timer/Counter, 16-bit"/>
                    </instance>
                </module>
                <module name="PORT">
                    <instance name="PORTA" caption="I/O Port">
                        <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                    <instance name="PORTB" caption="I/O Port">
                        <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                    <instance name="PORTC" caption="I/O Port">
                        <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                    <instance name="PORTD" caption="I/O Port">
                        <register-group name="PORTD" name-in-module="PORTD" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                    <instance name="PORTE" caption="I/O Port">
                        <register-group name="PORTE" name-in-module="PORTE" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                    </instance>
                </module>
                <module name="EEPROM">
                    <instance name="EEPROM" caption="EEPROM">
                        <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data"
                                        caption="EEPROM"/>
                    </instance>
                </module>
                <module name="FUSE">
                    <instance name="FUSE" caption="Fuses">
                        <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses"
                                        caption="Fuses"/>
                    </instance>
                </module>
